package com.itheima.demo06_二维数组;

public class Test2 {
    public static void main(String[] args) {
        //数组初始化
        //动态初始化
        //数据类型[][] 变量名 =  new  数据类型[一维数组个数][每个一维数组元素个数];
        int[][] arr1 = new int[2][]; //二维数组里存储了两个null
        /*
        {
            null,
            null
        }
         */
        int[][] arr2 = new int[2][0]; //二维数组里存储了两个一位数组,每个一维数组有0个元素
       /* {
            {},
            {}
        }*/
        int[][] arr3 = new int[2][2]; //二维数组里存储了两个null,每个一维数组有2个元素
        /* {
            {0,0},
            {0,0}
        }*/

        //静态初始化  可以定义长度不同的一维数组。
        //数据类型 [][] 变量名 =  new  数据类型[][] {数据1, 数据2,…}, {数据1, 数据2,…}, ……}
        //int[][] arr4 = new int[][]{
        //        {1, 2},
        //        {3, 4, 5},
        //        {6, 7, 8, 9}
        //};
        //简化格式
        int[][] arr4 = {
                         {1, 2},
                         {3, 4, 5},
                         {6, 7, 8, 9}
                        };
    }
}
